# Data Wrangling
In this guide, we focus on tools to help `combine`, `join`, and `rearrange data`.

<hr style="border:2px solid gray"> </hr>.

In [2]:
#Load the libraries
import pandas as pd
import numpy as np

from functools import reduce
from numpy import random

# 1. Hierarchial Indexing
`Hierarchical indexing` is an important feature of pandas that enables you to have `multiple (two or more) index levels on an axis`. Somewhat abstractly, it provides a way for you to work with `higher dimensional data` in a lower dimensional form. Let’s start with a simple example; create a Series with a list of lists (or arrays) as the index:

In [11]:
#Create dataframe
data = pd.Series(np.random.randn(9), 
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], 
                        [1,2,3,1,3,1,2,2,3]])

In [15]:
#View the data
data

a  1    0.931763
   2   -0.181711
   3    0.593671
b  1    1.314731
   3   -0.744804
c  1   -1.060770
   2   -0.721595
d  2   -1.466232
   3   -0.293753
dtype: float64

In [16]:
data['a']

1    0.931763
2   -0.181711
3    0.593671
dtype: float64

In [23]:
#Select the required index
data.loc[['a','b'],[1]]

a  1    0.931763
b  1    1.314731
dtype: float64

In [24]:
#Selection is even possible from an “inner” level:
data.loc[:,2]

a   -0.181711
c   -0.721595
d   -1.466232
dtype: float64

In [26]:
#Hierarchical indexing plays an important role in reshaping data and group-based operations like forming a pivot table.
#For example, you could rearrange the data into a DataFrame using its unstack method:
data.unstack()

          1         2         3
a  0.931763 -0.181711  0.593671
b  1.314731       NaN -0.744804
c -1.060770 -0.721595       NaN
d       NaN -1.466232 -0.293753

In [30]:
#The inverse operation of unstack is stack:
data.unstack().stack()

a  1    0.931763
   2   -0.181711
   3    0.593671
b  1    1.314731
   3   -0.744804
c  1   -1.060770
   2   -0.721595
d  2   -1.466232
   3   -0.293753
dtype: float64

In [31]:
#With a DataFrame, either axis can have a hierarchical index:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])

In [32]:
#View the dataframe
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [33]:
#The hierarchical levels can have names (as strings or any Python objects). If so, these will show up in the console output:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

----------

### 1.1 Reordering and Sorting
At times you will need to rearrange the order of the levels on an axis or sort the data by the values in one specific level. The `swaplevel`] takes two level numbers or names and returns a new object with the levels interchanged (but the data is otherwise unaltered):

In [34]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

`sort_index`, on the other hand, sorts the data using only the values in a single level. When swapping levels, it’s not uncommon to also use sort_index so that the result is lexicographically sorted by the indicated level:

In [39]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [40]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

----------

### 1.2 Summary Statistics by Level
Many descriptive and summary statistics on DataFrame and Series have a level option in which you can specify the level you want to aggregate by on a particular axis. Consider the above DataFrame; we can aggregate by level on either the rows or columns like so:

In [41]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [42]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

---------

### 1.3 Indexing with dataframe columns
It’s not unusual to want to use one or more columns from a DataFrame as the row index; alternatively, you may wish to move the row index into the DataFrame’s columns. Here’s an example DataFrame:

In [43]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two','two', 'two'],
                      'd':[0,1,2,0,1,2,3]})

In [44]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [45]:
#DataFrame’s set_index function will create a new DataFrame using one or more of its columns as the index:
frame2 = frame.set_index(['c', 'd'])

In [46]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [47]:
#By default the columns are removed from the DataFrame, though you can leave them in:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [48]:
#reset_index, on the other hand, does the opposite of set_index; the hierarchical index levels are moved into the columns:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

<hr style="border:2px solid gray"> </hr>.

# 2. Combining and Merging Datasets
**Data contained in pandas objects can be combined together in a number of ways:**
- `pandas.merge` connects rows in DataFrames based on one or more keys. This will be familiar to users of SQL or other relational databases, as it implements database join operations.
- `pandas.concat` concatenates or “stacks” together objects along an axis.
- The `combine_first` instance method enables splicing together overlapping data
to fill in missing values in one object with values from another.

In [51]:
#Create the first dataframe
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],'data1': range(7)})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [52]:
#Create the second dataframe
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],'data2': range(3)})
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [53]:
#This is an example of a many-to-one join; the data in df1 has multiple rows labeled a and b, 
#whereas df2 has only one row for each value in the key column. 
#Calling merge with these objects we obtain:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [54]:
#Note that I didn’t specify which column to join on. 
#If that information is not specified, merge uses the overlapping column names as the keys. 
#It’s a good practice to specify explicitly, though:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [55]:
#If the column names are different in each object, you can specify them separately:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

**2.1 Merging on Index**

In [56]:
#Create first dataframe
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'], 'value': range(6)})

In [57]:
#Create second dataframe
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [58]:
#Merge on index
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

<hr style="border:2px solid gray"> </hr>.

# End of sheet